<h1>迈启网授权协议</h1>

<p>版权所有 (c) 2005-2012，myqee.com保留所有权利。</p>

<p>感谢您选择迈启产品。希望我们的努力能为您提供一个高效快速、强大的站点解决方案，和强大的PHP开发解决方案。迈启网址为 http://www.myqee.com，产品官方讨论区网址为 http://bbs.myqee.com。</p>

<p>用户须知：本协议是您与迈启公司之间关于您非商业使用迈启公司提供的各种软件产品及服务的法律协议。无论您是个人或组织、盈利与否、用途如何（包括以学习和研究为目的），均需仔细阅读本协议，包括免除或者限制迈启责任的免责条款及对您的权利限制。请您审阅并接受或不接受本服务条款。如您不同意本服务条款及/或迈启随时对其的修改，您应不使用或主动取消迈启公司提供的迈启产品。否则，您的任何对迈启产品中的相关服务的注册、登陆、下载、查看等使用行为将被视为您对本服务条款全部的完全接受，包括接受迈启对服务条款随时所做的任何修改。</p>

<p>本服务条款一旦发生变更, 迈启将在网页上公布修改内容。修改后的服务条款一旦在网页上公布即有效代替原来的服务条款。您可随时登陆迈启官方论坛查阅最新版服务条款。如果您选择接受本条款，即表示您同意接受协议各项条件的约束。如果您不同意本服务条款，则不能获得使用本服务的权利。您若有违反本条款规定，迈启公司有权随时中止或终止您对迈启产品的使用资格并保留追究相关法律责任的权利。</p>

<p>在理解、同意、并遵守本协议的全部条款后，方可开始使用迈启产品。您可能与迈启公司直接签订另一书面协议，以补充或者取代本协议的全部或者任何部分。</p>

<p>迈启拥有本软件的全部知识产权。本软件只供许可协议，并非出售。迈启只允许您在遵守本协议各项条款的情况下复制、下载、安装、使用或者以其他方式受益于本软件的功能或者知识产权。</p>

<h3>I. 协议许可的权利</h3>
<ol>
<li>您可以在完全遵守本许可协议的基础上，将本软件应用于非商业用途，而不必支付软件版权许可费用。</li>
<li>您可以在协议规定的约束和限制范围内修改迈启产品源代码(如果被提供的话)或界面风格以适应您的网站要求。</li>
<li>您拥有使用本软件构建的网站中全部会员资料、文章及相关信息的所有权，并独立承担与使用本软件构建的网站内容的审核、注意义务，确保其不侵犯任何人的合法权益，独立承担因使用迈启软件和服务带来的全部责任，若造成迈启公司或用户损失的，您应予以全部赔偿。</li>

<li>本协议是您与迈启公司之间关于您非商业使用迈启公司提供的各种软件产品及服务的法律协议，若您需将迈启软件或服务用户商业用途，必须另行获得迈启的书面许可，您在获得商业授权之后，您可以将本软件应用于商业用途，同时依据所购买的授权类型中确定的技术支持期限、技术支持方式和技术支持内容，自购买时刻起，在技术支持期限内拥有通过指定的方式获得指定范围内的技术支持服务。商业授权用户享有反映和提出意见的权力，相关意见将被作为首要考虑，但没有一定被采纳的承诺或保证。</li>
</ol>

<h3>II. 协议规定的约束和限制</h3>
<ol>
<li>未获迈启公司书面商业授权之前，不得将本软件用于商业用途（包括但不限于企业网站、经营性网站、以营利为目或实现盈利的网站）。购买商业授权请登陆http://www.myqee.com参考相关说明。</li>
<li>不得对本软件或与之关联的商业授权进行出租、出售、抵押或发放子许可证。</li>
<li>无论如何，即无论用途如何、是否经过修改或美化、修改程度如何，只要使用迈启产品的整体或任何部分，未经书面许可，页面页脚处的迈启产品名称和迈启公司下属网站（http://www.myqee.com） 的链接都必须保留，而不能清除或修改。</li>
<li>禁止在迈启产品的整体或任何部分基础上以发展任何派生版本、修改版本或第三方版本用于重新分发。</li>
<li>如果您未能遵守本协议的条款，您的授权将被终止，所许可的权利将被收回，同时您应承担相应法律责任。</li>

</ol>

<h3>III. 有限担保和免责声明</h3>
<ol>
<li>本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的。</li>
<li>用户出于自愿而使用本软件，您必须了解使用本软件的风险，在尚未购买产品技术服务之前，我们不承诺提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任。</li>
<li>迈启公司不对使用本软件构建的网站中或者论坛中的文章或信息承担责任，全部责任由您自行承担。</li>
<li>迈启公司对迈启提供的软件和服务之及时性、安全性、准确性不作担保，由于不可抗力因素、迈启公司无法控制的因素（包括黑客攻击、停断电等）等造成软件使用和服务中止或终止，而给您造成损失的，您同意放弃追究迈启公司责任的全部权利。</li>
<li>迈启公司特别提请您注意，迈启公司为了保障公司业务发展和调整的自主权，迈启公司拥有随时经或未经事先通知而修改服务内容、中止或终止部分或全部软件使用和服务的权利，修改会公布于迈启公司网站相关页面上，一经公布视为通知。 迈启公司行使修改或中止、终止部分或全部软件使用和服务的权利而造成损失的，迈启公司不需对您或任何第三方负责。
</li>
</ol>

<p>有关迈启产品最终用户授权协议、商业授权与技术服务的详细内容，均由 迈启公司独家提供。迈启公司拥有在不事先通知的情况下，修改授权协议和服务价目表的权利，修改后的协议或价目表对自改变之日起的新授权用户生效。</p>
<p>一旦您开始安装迈启产品，即被视为完全理解并接受本协议的各项条款，在享有上述条款授予的权利的同时，受到相关的约束和限制。协议许可范围以外的行为，将直接违反本授权协议并构成侵权，我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。</p>
<p>本许可协议条款的解释，效力及纠纷的解决，适用于中华人民共和国大陆法律。</p>
<p>若您和迈启之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，您在此完全同意将纠纷或争议提交迈启所在地上海市徐汇区人民法院管辖。迈启公司拥有对以上各项条款内容的解释权及修改权。</p>
